
## Дана строка. Подсчитать, сколько в ней слов.

st = "I am student"
n_space=st.count(" ")
print (len(st))
print (n_space)

ans = len(st) - n_space
print (ans)