
# Сложные значения

kv1 =  [-100, 50, 200]
x = kv1[0]
y = kv1[1]
size = kv1[2]
print (x, y, size)


#---------------------------------------------------

fruit = {
	'apple': [50, 2.5],
	'orange': [80, 1.6],
	'banana': [60, 2.1]
}

price = fruit['apple'][0]             # какая цена яблок?
print (price)

kg    = fruit['apple'][1]             # сколько яблок купили?
print (kg)

price, kr = fruit['apple']            # сразу присвоили цену и килограммы
print (price, kg)

#-----------------------------------------------------------
























